IdeaRS.OpenModel.Detail.BarEndExtendType
Type of extension of bar

IdeaRS.OpenModel.Detail.BarEndExtendType.No
No extension

IdeaRS.OpenModel.Detail.BarEndExtendType.ExtendToSegment
Extension to the end of segment

IdeaRS.OpenModel.Detail.BarEndExtendType.ExtendByDistance
Extension by distance